Gatling/2017-10-16_13-19-49.595898/gatling-stdout.log
GATLING_HOME is set to /Users/daper01/.bzt/gatling-taurus/2.2.4
13:19:53.885 [ERROR] i.g.c.c.GatlingConfiguration$ - Your gatling.conf file is outdated, some properties have been renamed or removed.
Please update (check gatling.conf in Gatling bundle, or gatling-defaults.conf in gatling-core jar).
Enabled obsolete properties:
'gatling.http.ahc.allowPoolingSslConnections' was removed, dropped.
'gatling.http.ahc.allowPoolingConnections' was renamed into gatling.http.ahc.keepAlive.
Simulation BlazeDemo started...

================================================================================
2017-10-16 13:19:59                                           5s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=6      KO=0     )
> request_0                                                (OK=6      KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  0%
          waiting: 6093   / active: 1      / done:6     
================================================================================


================================================================================
2017-10-16 13:20:04                                          10s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=15     KO=0     )
> request_0                                                (OK=15     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[                                                                          ]  0%
          waiting: 6085   / active: 0      / done:15    
================================================================================


================================================================================
2017-10-16 13:20:09                                          15s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=24     KO=0     )
> request_0                                                (OK=24     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[                                                                          ]  0%
          waiting: 6076   / active: 0      / done:24    
================================================================================


================================================================================
2017-10-16 13:20:14                                          20s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=31     KO=0     )
> request_0                                                (OK=31     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  0%
          waiting: 6068   / active: 1      / done:31    
================================================================================


================================================================================
2017-10-16 13:20:19                                          25s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=40     KO=0     )
> request_0                                                (OK=40     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[                                                                          ]  0%
          waiting: 6060   / active: 0      / done:40    
================================================================================


================================================================================
2017-10-16 13:20:24                                          30s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=49     KO=0     )
> request_0                                                (OK=49     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[                                                                          ]  0%
          waiting: 6051   / active: 0      / done:49    
================================================================================


================================================================================
2017-10-16 13:20:29                                          35s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=57     KO=0     )
> request_0                                                (OK=57     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[                                                                          ]  0%
          waiting: 6043   / active: 0      / done:57    
================================================================================


================================================================================
2017-10-16 13:20:34                                          40s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=65     KO=0     )
> request_0                                                (OK=65     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[                                                                          ]  1%
          waiting: 6035   / active: 0      / done:65    
================================================================================


================================================================================
2017-10-16 13:20:39                                          45s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=74     KO=0     )
> request_0                                                (OK=74     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[                                                                          ]  1%
          waiting: 6026   / active: 0      / done:74    
================================================================================


================================================================================
2017-10-16 13:20:44                                          50s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=82     KO=0     )
> request_0                                                (OK=82     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[                                                                          ]  1%
          waiting: 6018   / active: 0      / done:82    
================================================================================


================================================================================
2017-10-16 13:20:49                                          55s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=90     KO=0     )
> request_0                                                (OK=90     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#                                                                         ]  1%
          waiting: 6010   / active: 0      / done:90    
================================================================================


================================================================================
2017-10-16 13:20:54                                          60s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=98     KO=0     )
> request_0                                                (OK=98     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#-                                                                        ]  1%
          waiting: 6001   / active: 1      / done:98    
================================================================================


================================================================================
2017-10-16 13:20:59                                          65s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=450    KO=0     )
> request_0                                                (OK=450    KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#####-                                                                    ]  7%
          waiting: 5605   / active: 45     / done:450   
================================================================================


================================================================================
2017-10-16 13:21:04                                          70s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=954    KO=0     )
> request_0                                                (OK=954    KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[###########-                                                              ] 15%
          waiting: 5105   / active: 41     / done:954   
================================================================================


================================================================================
2017-10-16 13:21:09                                          75s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=1445   KO=0     )
> request_0                                                (OK=1445   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#################-                                                        ] 23%
          waiting: 4605   / active: 50     / done:1445  
================================================================================


================================================================================
2017-10-16 13:21:14                                          80s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=1944   KO=0     )
> request_0                                                (OK=1944   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#######################-                                                  ] 31%
          waiting: 4105   / active: 51     / done:1944  
================================================================================


================================================================================
2017-10-16 13:21:19                                          85s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2448   KO=0     )
> request_0                                                (OK=2448   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#############################-                                            ] 40%
          waiting: 3605   / active: 47     / done:2448  
================================================================================


================================================================================
2017-10-16 13:21:24                                          90s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2949   KO=0     )
> request_0                                                (OK=2949   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[###################################-                                      ] 48%
          waiting: 3105   / active: 46     / done:2949  
================================================================================


================================================================================
2017-10-16 13:21:29                                          95s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=3449   KO=0     )
> request_0                                                (OK=3449   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#########################################-                                ] 56%
          waiting: 2605   / active: 46     / done:3449  
================================================================================


================================================================================
2017-10-16 13:21:34                                         100s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=3943   KO=0     )
> request_0                                                (OK=3943   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[###############################################-                          ] 64%
          waiting: 2105   / active: 52     / done:3943  
================================================================================


================================================================================
2017-10-16 13:21:39                                         105s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=4451   KO=0     )
> request_0                                                (OK=4451   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#####################################################-                    ] 72%
          waiting: 1605   / active: 44     / done:4451  
================================================================================


================================================================================
2017-10-16 13:21:44                                         110s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=4953   KO=0     )
> request_0                                                (OK=4953   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[############################################################-             ] 81%
          waiting: 1105   / active: 42     / done:4953  
================================================================================


================================================================================
2017-10-16 13:21:49                                         115s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=5455   KO=0     )
> request_0                                                (OK=5455   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[##################################################################-       ] 89%
          waiting: 605    / active: 40     / done:5455  
================================================================================


================================================================================
2017-10-16 13:21:54                                         120s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=5954   KO=0     )
> request_0                                                (OK=5954   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[########################################################################- ] 97%
          waiting: 105    / active: 41     / done:5954  
================================================================================


================================================================================
2017-10-16 13:21:59                                         125s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=6099   KO=0     )
> request_0                                                (OK=6099   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#########################################################################-] 99%
          waiting: 0      / active: 1      / done:6099  
================================================================================


================================================================================
2017-10-16 13:22:00                                         125s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=6100   KO=0     )
> request_0                                                (OK=6100   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done:6100  
================================================================================

Simulation BlazeDemo completed in 124 seconds
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                       6100 (OK=6100   KO=0     )
> min response time                                    221 (OK=221    KO=-     )
> max response time                                  11631 (OK=11631  KO=-     )
> mean response time                                   456 (OK=456    KO=-     )
> std deviation                                        560 (OK=560    KO=-     )
> response time 50th percentile                        345 (OK=345    KO=-     )
> response time 75th percentile                        408 (OK=408    KO=-     )
> response time 95th percentile                       1134 (OK=1134   KO=-     )
> response time 99th percentile                       2658 (OK=2658   KO=-     )
> mean requests/sec                                   48.8 (OK=48.8   KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                          5533 ( 91%)
> 800 ms < t < 1200 ms                                 279 (  5%)
> t > 1200 ms                                          288 (  5%)
> failed                                                 0 (  0%)
================================================================================

Reports generated in 1s.
Please open the following file: /Users/daper01/Documents/OSLo/Gatling/2017-10-16_13-19-49.595898/gatling-4509646288-1508174394509/index.html